tap "homebrew/bundle"
tap "homebrew/services"

# shell and text editing
cask "alacritty"
brew "fish"
brew "bat"
brew "fzf"
brew "helix"
brew "neovim"
brew "ripgrep"
brew "tealdeer"
brew "tmux"

# utilities
brew "curl"
brew "ffmpeg"
brew "htop"
brew "imagemagick"

# development
brew "clang-format"
brew "cmake"
brew "git-delta"
brew "julia"
brew "just"
brew "ninja"
brew "zig"

# apps
cask "audacity"
cask "blackhole-2ch"
cask "discord"
cask "gimp"
cask "inkscape"
cask "slack"
